[
    {
        "dateAndLocation": "Detroit, 9/10/60",
        "description": "Mantle unloaded an incredible home run over the right-field roof Diagram of Mickey Mantle's epic 643-foot home run hit at Tiger Stadium in Detroit on Sept. 10, 1960 - Accoring to the Guinness Book of World Records, it's the longest home run ever measure after the fact.through a light tower (which it may have grazed) and out of the park. The pitcher was Paul Foytack. Years later researcher Paul Susman, Ph.D. found eyewitnesses who confirmed exactly where the ball landed on the fly. Dr. Susman then measured the distance, which turned out to be an astonishing 643 feet! This was almost certainly the longest home run Mickey hit in a regular season game that could actually be measured to the spot it landed, and probably the longest homer anyone ever hit in a regular season game that could be measured to the actual landing point. This 643-foot home run is listed in the Guinness Book of World Records as the longest homer ever \"measured trigonometrically.\"",
        "imgSrc": "9-10-60-detr-643-ft-hr-frm.jpeg"
    },
    {
        "dateAndLocation": "Detroit, 6/18/56",
        "description": " The Mick walloped a tremendous homer over the right-field roof between the light standard and the end of the upper deck. The ball went completely out of the park and landed on the adjacent Trumbull Avenue. It was all the more impressive because it was hit into a stiff wind. Again, the pitcher was Paul Foytack. (This was the first out-of-the-park homer Mantle hit off Foytack.) This home run brought about Tigers' manager Bucky Harris' famous remark, \"That would bring tears to the eyes of a rocking chair.\" Just two days later Mickey would hit two homers into the upper deck bleachers in centerfield at Briggs Stadium - something no player had ever done even once. Both of those home runs landed high above the 400 foot sign in the left-centerfield bleachers.",
        "imgSrc": "tiger-stad-arrow-frm.jpeg"
    },
    {
        "dateAndLocation": "Detroit, 9/17/58 ",
        "description": "Although batting into a stiff wind, Mickey powered an amazing left-handed home run shot down the rightfield line that the rocketed high over the right-field roof at Tiger Stadium (then called Briggs Stadium). The ball was fair by about 10 feet. It went completely out of the park, crossed the adjacent Trumbull Avenue and slammed against the second story of a building on the far side of Trumbull avenue. A cab driver recovered the ball. This ball traveled well over 500 feet. Had it not struck the building it would have ranked as one of Mickey's absolute longest homers. The pitcher for the Tigers was Jim Bunning.",
        "imgSrc": "no-img.jpeg"
    },
    {
        "dateAndLocation": "Baltimore, 8/10/57 ",
        "description": "Mickey launched a spectacular and historic home run at Memorial Stadium in Baltimore. He hit a high, long home run drive that carried well over the the fence in centerfield and continued on its path past a hedge thirty feet beyond the centerfield fence. No one in the history of Memorial Stadium had ever hit a home run that cleared the hedge beyond the centerfield fence, which was over 460 feet from home plate. Mickey's was the first. The ball traveled well past the hedge and continued on to an estimated length of 540 feet. It was the longest home run ever hit to centerfield at Memorial Stadium in Baltimore. The pitcher for the Orioles was Ray Moore.",
        "imgSrc": "balt-mem-hr-diag-frm.jpeg"
    },
    {
        "dateAndLocation": "Brooklyn, 10/3/56",
        "description": " In the first inning of the first game of the World Series against the Brooklyn Dodgers Mickey crushed a two-run home run that flew high over the right-field screen at Ebbets Field. It continued its arc over the neighboring Bedford Avenue and landed in a neighboring parking lot across the street, where it caused about $500 in damage when souvenir hunters scrambled over the cars in search of the home run ball for a trophy. The distance was well over 500 feet. The pitcher for the Dodgers was Sal Maglie, who went on to win this game for the Dodgers 6-3. Maglie is better known as the losing pitcher in Game 5 of the 1956 World Series on October 8, 1956, when Don Larsen pitched his perfect game at Yankee Stadium.",
        "imgSrc": "ebbets-field-10-3-56-250ph.jpeg"
    },
    {
        "dateAndLocation": "Yankee Stadium, 6/21/55",
        "description": "In the first inning against the Kansas City Athletics. Alex Kellner, a lefty, tried throwing Mickey a change-up. Batting right-handed, Mickey laid into it and absolutely hammered it. The ball took off on a bullet-like line drive path that shot past Kellner's ear and continued to rise until it shot over the 30-foot high centerfield screen near the 461-foot sign. It smashed into a seat in the ninth row of the bleachers, 486 feet from home plate. No one - not Babe Ruth, not Joe DiMaggio, not Lou Gehrig, not Hank Greenberg nor Jimmy Foxx - had ever hit a home run into the centerfield black seats at Yankee Stadium. Hitting a ball into the centerfield black seats was the Holy Grail of Yankee Stadium and another first for Mickey Mantle. Observers said that the sound that Mickey's bat made when he hit the ball was like an explosion. Jackie Farrell of the Yankees PR staff manages to get the ball from the fan who caught it, Oscar Alonso, and after some negotiating is able to send it to the Baseball Hall of Fame.",
        "imgSrc": "no-img.jpeg"
    },
    {
        "dateAndLocation": "Yankee Stadium, 5/30/56 ",
        "description": "Mickey belted his first shot to hit the façade in right-field. While no ball ever went out of Yankee Stadium during a game, this one missed by only 18 inches or less. The pitcher was Pedro Ramos. It is believed that Mickey twice jacked balls out of Yankee Stadium in right-field during batting practice and once even cleared the left-field seats in batting practice. If true, these were among the most epic shots in the history of the game. This was the first of five home runs Mickey hit in his career that struck the façade at Yankee Stadium. It's not likely that any player will ever equal that total.",
        "imgSrc": "ramos-hr-frm.gif"
    },
    {
        "dateAndLocation": "Yankee Stadium, 5/22/63",
        "description": "\"The hardest ball I ever hit was at Yankee Stadium in 1963.\" - Mickey Mantle. Mickey pulverized a ball that rocketed through the night toward the upper reaches of Yankee Stadium. Yogi Berra, thinking the ball was going out of the park, cried out, \"This is it!\" Players from both teams jumped off their benches to watch history be made. But the ball struck the right-field façade just inches from the top. Mickey hit it with so much force that after slamming into the cement façade it ricocheted all the way back to the infield on the fly. The pitcher was Bill Fischer of the Kansas City A's. Mathematicians have calculated that, had the ball not struck the Yankee Stadium façade, it would have traveled at least 620 feet. This distance assumes the ball was at its apex when it hit the façade, and eyewitnesses are in unanimous agreement that the ball was still rising. Therefore, 620 feet is the low end distance estimate. A computer projection calculated that (had the ball not been obstructed by the façade) it would have been an astronomical 734-foot home run!",
        "imgSrc": "hardest-ball-hr-red-arrow.jpeg"
    },
    {
        "dateAndLocation": "Bovard Field, University of Southern California, 3/26/51",
        "description": "In an exhibition game during a pre-season barnstorm tour of the west coast, Mickey blasted two long homers in the same game, one righty (it went out of the park, across a street and landed on the roof of a three-story house several houses down the street, a distance over 600 feet) and one lefty. The left-handed homer is a legendary shot that may well be the longest homer ever hit anywhere by anyone. It cleared the right-centerfield wall, crossed an adjacent football field, and landed 656 feet from home plate on the fly. This home run is well documented with two eye-witnesses (the USC center fielder, Tom Riach, and legendary USC Coach Rod Dedeaux). Both walked out (separately) after the game and pointed to the spot the ball landed. The two spots they pointed to were only a few feet apart. The photo of this home run (and many others) is in the film, Mickey Mantle: The American Dream Comes To Life®, as well as the film's companion volume with the same name, and in the 1998, 1999 and 2000 This Day in Mickey Mantle History® Photo Calendar - Fact Books.",
        "imgSrc": "bovard-hrs-frm.gif"
    },
    {
        "dateAndLocation": "Houston Astrodome, 4/9/65 ",
        "description": "In an exhibition game played before the start of the 1965 season, the Yankees went to Houston to play the Houston Astros in the first game in the first indoor baseball stadium in the world - the Houston Astrodome. It was not only the first indoor ballpark, it later sported artificial grass that came to be known as \"astroturf.\" However, on April 9, 1965 the Astrodome had a field of Bermuda grass. Judge Roy Hofheinz, owner of the Astros, decided to christen the new ballpark - nicknamed \"The Eighth Wonder of the World\" - with an exhibition game against the Yankees. It was hoped the Mickey Mantle might hit a home run during the game and - possibly - the first home run ever in an indoor stadium. Mickey did not disappoint. Although injured, manager Johnny Keane put Mickey into the lineup in the first position. Leading off in the first inning for the Yankees, The Mick lined the second pitch of the game into centerfield for a single for the first hit in Astrodome history. Then, leading off in the sixth, he slammed a majestic drive deep into the centerfield stands near the 406 foot marker for a thunderous home run. As Mickey limped around the bases the crowd cheered him as if he were one of their own. In the photo to the right Mickey awaits the pitch from Turk Farrell that he belted for the first home run ever hit in the Houston Astrodome. ",
        "imgSrc": "first-astrodome-hr-frm.jpeg"
    }
]