[
    {
        "title": "How I Became a Yankee",
        "description": "Mickey tells the story of how he was discovered by Yankees scout Tom Greenwade at a high-school game in Oklahoma, and how Greenwade signed him to the New York Yankees. (4:03)",
        "src": "https://www.youtube.com/embed/lbU-MaGqP58"      
    },
    {
        "title": "How I Signed My First Yankees' Contract",
        "description": "Mickey tells the story of how his first Yankees' contract was engineered by Casey Stengel on the train ride to Opening Day (2:51)",
        "src": "https://www.youtube.com/embed/oZm9oxETGsE"
        
    },
    {
        "title": "My Knee Injury in the 1951 World Series",
        "description": "Mickey tells how his knee was injured in the first game of the 1951 World Series at Yankee Stadium, and how he found out about his father's illness. (2:37)",
        "src": "https://www.youtube.com/embed/I7EEkFBDSYA"
        
    },  
    {
        "title": "My First Great Thrill in Baseball",
        "description": "Mickey tells the story about his first great thrill as a Yankee, in the 1951 World Series against the Brooklyn Dodgers and Jackie Robinson. (1:28)",
        "src": "https://www.youtube.com/embed/VcLtTIOtSto"
        
    },
    {
        "title": "Billy Martin the Jokester",
        "description": "Mickey talks about how Billy Martin loved to play pranks and practical jokes - even on the legendary Joe DiMaggio! (1:41)",
        "src": "https://www.youtube.com/embed/VeOg4xtVbcA"
        
    },
    {
        "title": "Billy Martin Pranks Jackie Jensen",
        "description": "Mickey tells the story about how Billy Martin played a practical joke on Jackie Jensen - who had a great fear of flying - on the team's flight to Japan to play exhibition games. (1:22)",
        "src": "https://www.youtube.com/embed/_D0PdylFKAU"
        
    },
    {
        "title": "ow Whitey Ford Got Nicknamed 'Slick'",
        "description": "Mickey tells the story of how his best friend Whitey Ford got the nickname 'Slick' when Casey Stengel lectured the Yankees during a team meeting. (2:03)",
        "src": "https://www.youtube.com/embed/BKdnTz7hfLE"
        
    },
    {
        "title": "Breaking Curfew with Billy Martin in Boston",
        "description": "Mickey tells how he and Billy Martin arrived at their hotel in Boston after curfew and how they managed to get past Casey and back to their room. (1:45)",
        "src": "https://www.youtube.com/embed/H6QPcIRe9bk"
        
    },
    {
        "title": "The Fight at the Copacabana Nightclub",
        "description": "Mickey tells the story about the brawl at the Copacabana nightclub, when a fight broke out between Yankees' players and some drunken patrons while celebrating Billy Martin's birthday. (3:33)",
        "src": "https://www.youtube.com/embed/cuGnaUIBQrA"
        
    },
    {
        "title": "Billy Martin Gets Traded",
        "description": "Mickey tells the story of how his best friend Billy Martin was traded from the Yankees to the Kansas City Athletics, breaking up the 'Three Musketeers' - Mickey, Billy Martin & Whitey Ford. (1:26)",
        "src": "https://www.youtube.com/embed/cyydHJiwfP0"
        
    },
    {
        "title": "Flying into a Storm Over the Great Lakes",
        "description": "Mickey tells the story about how the Yankees flew into a vicious storm over the Great Lakes, and how some of the players reacted to it. (1:19)",
        "src": "https://www.youtube.com/embed/ZEWa4PVB_bU"
        
    },
    {
        "title": "My Swimming Race with Roger Maris",
        "description": "Mickey tells the story about how Whitey Ford helped Mickey rig a swimming race with Roger Maris at Bob Turley's house in Baltimore. (1:41)",
        "src": "https://www.youtube.com/embed/1kca8gV3cyY"
        
    },
    {
        "title": "The 1961 Home Run Race with Roger Maris",
        "description": "Mickey talks about his home run race with Roger Maris in 1961, the year Maris broke Babe Ruth's single season record by hitting 61 home runs. (0:53)",
        "src": "https://www.youtube.com/embed/U5Ew48mxTeU"
        
    },
    {
        "title": "The Hardest Ball I Ever Hit",
        "description": "Mickey tells the story about the hardest ball I ever hit - his walk-off home run off Bill Fischer on May 22, 1963. It hit the Yankee Stadium facade and missed going out of Yankee Stadium by mere inches. (0:59)",
        "src":"https://www.youtube.com/embed/WeS1t9jSW8k" 
        
    },
    {
        "title": "My 'Called Shot' in the 1964 World Series",
        "description": "Mickey tells the story of his walk-off World Series home run off Barney Schultz of the Cardinals in the 1964 World Series. It was The Mick's 16th Series home run, and it broke Babe Ruth's record World Series home run record. (1:19)",
        "src": "https://www.youtube.com/embed/QTZz_hdm2TY"
        
    },
    {
        "title": "The Denny McLain 'Gift' Home Run",
        "description": "Mickey tells the story about how Denny McLain 'gifted' Mickey his career home run #535 at Tiger Stadium in Detroit during Mickey's last season. (2:00)",
        "src": "https://www.youtube.com/embed/qdl6ABq6E3w"
        
    },
    {
        "title": "My Favorite Story - The Billy Martin Cow Story",
        "description": "Regarded by many to be the greatest of all of Mickey's stories, Mickey tells how he and  Billy Martin went hunting in the off-season in Texas one year. Mickey decided to play a prank on Billy with dire, yet hilarious, consequences. (2:57)",
        "src": "https://www.youtube.com/embed/S5t_9PKffmM"
        
    }
]